parsing-tech-log/src/InformationRegisters/ГраницыЧтенияДанных/ГраницыЧтенияДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ГраницыЧтенияДанных</name>
  <resources>
    <name>ПрочитаноСтрок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПрочитанПолностью</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Замер</name>
    <type>
      <types>CatalogRef.Замеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Процесс</name>
    <type>
      <types>CatalogRef.Процессы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПроцессID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаФайла</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

parsing-tech-log/src/InformationRegisters/ГраницыЧтенияДанных/ManagerModule.bsl
#Если Сервер ИЛИ ВнешнееСоединение Тогда
	
Функция ПолучитьСостояние(Замер, Процесс, ПроцессИД, ПериодФайла) Экспорт
	Результат = Новый Структура("ПрочитаноСтрок,ПрочитанПолностью", 0, Ложь);
	
	ПроцессСсылка = СправочникиСерверПовтИсп.ПолучитьПроцесс(Процесс);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ГраницыЧтенияДанных.ПрочитаноСтрок,
	|	ГраницыЧтенияДанных.ПрочитанПолностью
	|ИЗ
	|	РегистрСведений.ГраницыЧтенияДанных КАК ГраницыЧтенияДанных
	|ГДЕ
	|	ГраницыЧтенияДанных.Замер = &Замер
	|	И ГраницыЧтенияДанных.Процесс = &Процесс
	|	И ГраницыЧтенияДанных.ПроцессID = &ПроцессИд
	|	И ГраницыЧтенияДанных.ДатаФайла = &ДатаФайла";
	Запрос.УстановитьПараметр("Замер", Замер);
	Запрос.УстановитьПараметр("Процесс", ПроцессСсылка);
	Запрос.УстановитьПараметр("ПроцессИД", ПроцессИД);
	Запрос.УстановитьПараметр("ДатаФайла", ПериодФайла);
	РезультатЗапроса = Запрос.Выполнить(); 
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ЗаполнитьЗначенияСвойств(Результат, РезультатЗапроса.Выгрузить()[0]);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Процедура УстановитьСостояние(Замер, Процесс, ПроцессID, Период, ПрочитаноСтрок, ДатаНачалаЧтения) Экспорт
	
	//если дата начала чтения больше чем конец часа (запас в 5 минут) 
	//считаем что файл больше дополняться не будет
	ПрочитанПолностью = ДатаНачалаЧтения > КонецЧаса(Период) + 300;
	
	ТекущееСостояние = ПолучитьСостояние(Замер, Процесс, ПроцессID, Период);
	Если ТекущееСостояние.ПрочитаноСтрок = ПрочитаноСтрок
		И ТекущееСостояние.ПрочитанПолностью = ПрочитанПолностью Тогда
		Возврат;
	КонецЕсли;	
	
	МенеджерЗаписи = РегистрыСведений.ГраницыЧтенияДанных.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Замер = Замер;
	МенеджерЗаписи.Процесс = СправочникиСерверПовтИсп.ПолучитьПроцесс(Процесс);
	МенеджерЗаписи.ПроцессID = ПроцессID;
	МенеджерЗаписи.ДатаФайла = Период;
	МенеджерЗаписи.ПрочитаноСтрок = ПрочитаноСтрок;
	МенеджерЗаписи.ПрочитанПолностью = ПрочитанПолностью;
	МенеджерЗаписи.Записать();		
	
КонецПроцедуры

#КонецЕсли
